[
    {
        "Judul": "The Soul of a New Machine",
        "Penulis": "Tracy Kiddere",
        "Deskripsi": "It chronicles the experiences of a computer engineering team racing to design a next-generation computer at a blistering pace under tremendous pressure.",
        "Tahun Terbit": 1981,
        "tag": [
            "Sains"
        ]
    },
    {
        "Judul": "Algorithms to Live By: The Computer Science of Human Decisions",
        "Penulis": "Brian Christian, Tom Griffiths, Thomas L. Griffiths",
        "Deskripsi": "Algorithms to Live By by Brian Christian and Tom Griffiths is an immersive look at the history and development of several algorithms used to solve computer science problems. ",
        "Tahun Terbit": 2016,
        "tag": [
            "Sains",
            "Pendidikan"
        ]
    },
    {
        "Judul": "Hackers: Heroes of the Computer Revolution",
        "Penulis": "Steven Levy",
        "Deskripsi": "Summary. Levy traces developments in the history of hacking, beginning with The Tech Model Railroad Club at MIT, whose members were among the first hackers.",
        "Tahun Terbit": 1984,
        "tag": [
            "Pendidikan"
        ]
    },
    {
        "Judul": "Jago Komputer",
        "Penulis": "Firman",
        "Deskripsi": "Disini kita akan menjelaskan cara membuat website dan coding",
        "Tahun Terbit": 2018,
        "tag": [
            "Gadget",
            "Pendidikan"
        ]
    },
    {
        "Judul": "Introduction to Algorithms",
        "Penulis": "Thomas H. Cormen, Charles E. Leiserson, Ronald L. Rivest, and Clifford Stein",
        "Deskripsi": "Disini kita akan menjelaskan cara membuat website dan coding",
        "Tahun Terbit": 1989,
        "tag": [
            "Sains",
            "Pendidikan"
        ]
    },
    {
        "Judul": "Computer Architecture: A Quantitative Approach",
        "Penulis": "John L. Hennessy, David A Patterson",
        "Deskripsi": "explores the ways that software and technology in the cloud are accessed by digital media, such as cell phones, computers, tablets, and other mobile devices.",
        "Tahun Terbit": 1992,
        "tag": [
            "Sains",
            "Pendidikan"
        ]
    },
    {
        "Judul": "Discrete Mathematics and Its Applications",
        "Penulis": "Kenneth H. Rosen",
        "Deskripsi": "The branch of mathematics handling objects that only considers distinct, separated values.",
        "Tahun Terbit": 2011,
        "tag": [
            "Sains",
            "Pendidikan"
        ]
    },
    {
        "Judul": "The Practical SQL Handbook: Using SQL Variants",
        "Penulis": "Sandra L Emerson",
        "Deskripsi": "begins with a step-by-step introduction to SQL basics and examines the issues involved in designing SQL-based database applications.",
        "Tahun Terbit": 2001,
        "tag": [
            "Pendidikan"
        ]
    },
    {
        "Judul": "The C++ Programming Language",
        "Penulis": "Bjarne Stroustrup",
        "Deskripsi": "C++ (or “C-plus-plus”) is a generic programming language for building software. It's an object-oriented language. In other words, it emphasizes using data fields with unique attributes (a.k.a. objects) rather than logic or functions. A common example of an object is a user account on a website.",
        "Tahun Terbit": 2013,
        "tag": [
            "Sains",
            "Pendidikan"
        ]
    }
]